// highspeed-lines.js

// 예시 데이터 구조
export const highspeedData = [
    {
        name: 'SRT',
        coordinates: [[-196, 301], [-196, 884], [-232, 920], [-2019, 920], [-2031, 922], [-2845, 922]], // 좌표 데이터
        solidColor: '#25437B', // 실선 색상
        dashedColor: '#FFFFFF' // 점선 색상
    },
    {
        name: 'KTX',
        coordinates: [[-310, -120], [-310, 1336], [-318, 1373], [-318, 1499], [-321, 1511], [-333, 1515], [-1972, 1515], [-1982, 1511], [-1986, 1502],  [-1986, 993]], // 좌표 데이터
        solidColor: '#25437B', // 실선 색상
        dashedColor: '#FFFFFF' // 점선 색상
    },
    {
        name: 'ITX',
        coordinates: [
          [-282, 1295],
          [-282, 1167],
          [-277, 1146],
          [-265, 1123],
          [-255, 1109],
          [-238, 1096],
          [-218, 1087],
          [-197, 1083],
          [65, 1083],
          [374, 1083],
          [397, 1078],
          [417, 1067],
          [427, 1059],
          [439, 1044],
          [447, 1025],
          [450, 1009],
          [450, -245],
], // 좌표 데이터
        solidColor: '#3E4141', // 실선 색상
        dashedColor: '#FFFFFF' // 점선 색상
    }


];
